app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])
    p @user.pass = passgene

    #######################
    ##  戻るボタンの判定  ##
    #######################

    if params[:fix]
      render :action => :new
      return
    end

    if @user.save
---
INSERT INTO `users` (`name`, `design_theme_id`, `created_at`, `delete_flg`, `nesw_letter_flg`, `updated_at`, `other_url`, `dm_news_flg`, `lock_version`, `mail`, `follow_news_flg`, `self_introduction`, `pass`, `now_place`, `icon_image`) VALUES('種市貴文', 0, '2009-07-10 08:04:18', 0, 0, '2009-07-10 08:04:18', NULL, 0, 0, 'tanetane', 0, NULL, 'eva', NULL, NULL)

  def delete
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 2)
DELETE FROM `users` WHERE `id` = 1